Revit 2024 API
BuiltInFailures.EditingFailures.AllInvisibleInPlanViewWarn Property
 None of the created elements are visible in [View Type] View. You may want to check the active view, its Parameters, and Visibility settings, as well as any Plan Regions and their settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AllInvisibleInPlanViewWarn { get; }
Visual Basic
Public Shared ReadOnly Property AllInvisibleInPlanViewWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AllInvisibleInPlanViewWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace